---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Electrical.LightingDevice
source: html/b34e2a5c-4951-9a17-bb82-2ac7ee7db85b.htm
---
# LightingDevice Members

Causes the object to release immediately any resources it may be utilizing.